Автоматизированная_проверка_конфигураций_демо/src/InformationRegisters/ВерныеСлова/ВерныеСлова.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерныеСлова</name>
  <dimensions>
    <name>Слово</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Автоматизированная_проверка_конфигураций_демо/src/InformationRegisters/КомментарииНайденныхОшибок/КомментарииНайденныхОшибок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КомментарииНайденныхОшибок</name>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.СтруктураКонфигурации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Автоматизированная_проверка_конфигураций_демо/src/InformationRegisters/НайденныеОшибки/НайденныеОшибки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НайденныеОшибки</name>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>CatalogRef.ОбнаруживаемыеОшибки</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеОшибки</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>АвторОсобенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПомещенияВОсобенности</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>МестоОбнаружения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Уточнение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>999</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОсобенности</name>
    <type>
      <types>CatalogRef.ПричиныОсобенности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийИдентификаторОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.СтруктураКонфигурации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Правило</name>
    <type>
      <types>CatalogRef.Правила</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Автоматизированная_проверка_конфигураций_демо/src/InformationRegisters/ТребованияККонфигурации/ТребованияККонфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТребованияККонфигурации</name>
  <dimensions>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВариантПроверки</name>
    <type>
      <types>CatalogRef.ВариантыПроверки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Требование</name>
    <type>
      <types>CatalogRef.Требования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Автоматизированная_проверка_конфигураций_демо/src/InformationRegisters/УдалитьОсобенности/УдалитьОсобенности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УдалитьОсобенности</name>
  <comment>Особенности конфигураций, которые не считаются ошибками</comment>
  <resources>
    <name>ПричинаОсобенности</name>
    <type>
      <types>CatalogRef.ПричиныОсобенности</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПомещенияВОсобенности</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>АвторОсобенности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Уточнение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>999</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <comment>Реквизит &quot;Путь&quot; у справочника &quot;Структура конфигурации&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>555</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ошибка</name>
    <type>
      <types>CatalogRef.ОбнаруживаемыеОшибки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Автоматизированная_проверка_конфигураций_демо/src/Enums/СостояниеОшибки/СостояниеОшибки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеОшибки</name>
  <enumValues>
    <name>Зарегистрирована</name>
  </enumValues>
  <enumValues>
    <name>Исправлена</name>
  </enumValues>
  <enumValues>
    <name>Особенность</name>
  </enumValues>
</mdclass:Enum>

Автоматизированная_проверка_конфигураций_демо/src/Documents/ПроверкаВерсии/ПроверкаВерсии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроверкаВерсии</name>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>CatalogRef.Версии</types>
    </type>
  </attributes>
  <attributes>
    <name>Эталон</name>
    <type>
      <types>CatalogRef.Версии</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖурналПроверки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееВремя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбнаруженоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПроверки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяемыеОбъекты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьВсеОшибкиКакОсобенности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставОбъектов</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.СтруктураКонфигурации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставТребований</name>
    <attributes>
      <name>Требование</name>
      <type>
        <types>CatalogRef.Требования</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Автоматизированная_проверка_конфигураций_демо/src/Catalogs/Требования/Требования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Требования</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Совместимо</name>
      <description>1С:Совместимо (1С:Предприятие 8.3)</description>
    </items>
    <items>
      <name>Орфография</name>
      <description>Орфография</description>
    </items>
    <items>
      <name>СистемаСтандартов</name>
      <description>Система стандартов</description>
    </items>
    <items>
      <name>ПлатформеннаяПроверкаКонфигурации</name>
      <description>Платформенная проверка конфигурации</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмВалидации</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньИсполнения</name>
    <type>
      <types>EnumRef.КатегорияТребований</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаСтандарт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПроверки</name>
    <type>
      <types>EnumRef.СпособПроверки</types>
    </type>
  </attributes>
  <attributes>
    <name>УправляемоеПриложение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбычноеПриложение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрименяетсяДля1ССовместимо</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыТребований</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РеализацияТребования</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоПроверки</name>
      <type>
        <types>CatalogRef.Правила</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеHTML</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроверяемыеОшибки</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ошибка</name>
      <type>
        <types>CatalogRef.ОбнаруживаемыеОшибки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыПроверки</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>EnumRef.ЭтапыПроверки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Автоматизированная_проверка_конфигураций_демо/src/Catalogs/Правила/Правила.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Правила</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Аудит</name>
      <description>Аудит решения</description>
    </items>
    <items>
      <name>Интерфейс</name>
      <description>Проверка интерфейса</description>
    </items>
    <items>
      <name>ТестированиеФункциональности</name>
      <description>Тестирование функциональности</description>
    </items>
  </predefined>
  <attributes>
    <name>Дополнение</name>
    <type>
      <types>CatalogRef.Дополнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверкаРеализованаДополнением</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Алгоритм</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяПроверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолуавтоматическаяПроверка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяПриПроверке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененоПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбслуживаемыеТипы</name>
    <attributes>
      <name>ТипОбъекта</name>
      <type>
        <types>EnumRef.ТипыОбъектов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбнаруживаемыеОшибки</name>
    <attributes>
      <name>Ошибка</name>
      <type>
        <types>CatalogRef.ОбнаруживаемыеОшибки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ресурсы</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Автоматизированная_проверка_конфигураций_демо/src/Catalogs/ОбнаруживаемыеОшибки/ОбнаруживаемыеОшибки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбнаруживаемыеОшибки</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ОшибкаИнтерфейса</name>
      <description>Ошибка, найденная в интерефейсе решения</description>
    </items>
    <items>
      <name>ОшибкаАудита</name>
      <description>Ошибка, найденная при аудите решения</description>
    </items>
    <items>
      <name>ОшибкаФункциональности</name>
      <description>Ошибка, найденная при проверке функциональности</description>
    </items>
  </predefined>
  <attributes>
    <name>Критичность</name>
    <type>
      <types>EnumRef.УровниКритичностиОшибок</types>
    </type>
  </attributes>
  <attributes>
    <name>Рекомендация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

Автоматизированная_проверка_конфигураций_демо/src/CommonModules/ОбновлениеИнформационнойБазы/Module.bsl
#Область СлужебныеПроцедурыИФункции

// При смене версии конфигурации обновляет в фоне правила и требования
// и производит изменения в базе в зависимости от номера релиза.
//
Процедура ВыполнитьОбновлениеИнформационнойБазыФоновымЗаданием() Экспорт
	
	Попытка
		
		// Проверка новой версии и обновление правил и программ проверки.
		ЗначениеКонстанты = Константы.НомерВерсииКонфигурации.Получить();
		МассивЭлементовКонстанты = СтрРазделить(ЗначениеКонстанты, Символы.Таб);
		НомерВерсииКонфигурации = МассивЭлементовКонстанты[0];
		
		ВерсияМетаданных = Метаданные.Версия;
		
		Если НомерВерсииКонфигурации <> ВерсияМетаданных Тогда
			
			#Если Клиент Тогда
			ТекстСостояния = СтрШаблон(НСтр("ru='Идет процесс обновления конфигурации до версии %1'"), ВерсияМетаданных);
			Состояние(ТекстСостояния);
			#КонецЕсли
			
			ОбъектОбновления = Обработки.ОбновлениеТребованийИПравилПроверки.Создать();
			
			Если РелизыПоПорядку(НомерВерсииКонфигурации, "1.1.2.16")
				И РелизыПоПорядку("1.1.2.15", ВерсияМетаданных) Тогда
				
				ИзменитьГруппыСтандартов();
			КонецЕсли;
			
			Если РелизыПоПорядку(НомерВерсииКонфигурации, "1.1.6.8")
				И РелизыПоПорядку("1.1.5.20", ВерсияМетаданных) Тогда
				
				УдалитьСтандартыСовместимо();
			КонецЕсли;
			
			ОчиститьРегистрСведенийВерныеСлова();
			
			#Если Клиент Тогда
			ТекстСостояния = НСтр("ru='Выполняется обновление правил и программ проверки до версии %1'");
			ТекстСостояния = СтрШаблон(ТекстСостояния, ВерсияМетаданных);
			Состояние(ТекстСостояния);
			#КонецЕсли
			
			ОбъектОбновления.ОбновитьПравилаПроверки();
			
			Если РелизыПоПорядку(НомерВерсииКонфигурации, "1.1.7.22")
				И РелизыПоПорядку("1.1.6.10", ВерсияМетаданных) Тогда
				
				ОбновитьГруппыТребованийНаПредопределенные();
			КонецЕсли;
			
			УдалитьУстаревшиеСтандарты();
			
			Если РелизыПоПорядку(НомерВерсииКонфигурации, "1.1.8.16") Тогда
				УдалитьДублиТребований();
				УдалитьДублиПричинОсобенностей();
				УдалитьДублиОбнаруживаемыхОшибок();
				УдалитьДублиПравил();
				ДобавитьПредопределенныеПричиныОсобенностей();
			КонецЕсли;
			
			Если РелизыПоПорядку(НомерВерсииКонфигурации, "1.1.8.22") Тогда
				ПометитьНаУдалениеСлужебноеТребование();
			КонецЕсли;
			
			Если РелизыПоПорядку(НомерВерсииКонфигурации, "1.1.9.15") Тогда
				ЗаполнитьПользователейОС();
			КонецЕсли;
			
			Если РелизыПоПорядку(НомерВерсииКонфигурации, "1.1.9.45") Тогда
				ЗаполнитьОбъектВРегистреКомментариевОшибок();
			КонецЕсли;
			
			Если РелизыПоПорядку(НомерВерсииКонфигурации, "1.1.9.58") Тогда
				ПометитьНаУдалениеУстаревшиеДокументы();
			КонецЕсли;
			
			Если РелизыПоПорядку(НомерВерсииКонфигурации, "1.1.12.1") Тогда
				УстановитьРасширеннуюПроверкуДляКонфигураций();
			КонецЕсли;
			
			Если РелизыПоПорядку(НомерВерсииКонфигурации, "1.1.12.25") Тогда
				УстановитьНовоеРасписаниеРегламентногоЗаданияУведомлениеОтветственных();
			КонецЕсли;
			
			Если РелизыПоПорядку(НомерВерсииКонфигурации, "1.2.1.1") Тогда
				ЗаполнитьТабличнуюЧастьРасписанийПроверкиКонфигураций();
				УдалитьКомментарииОтсутствующихОшибок();
				ПеренестиФлагиСобранныхДанныхВТабличнуюЧасть();
				СинхронизироватьОшибкиИОсобенности();
			КонецЕсли;
			
			Константы.НомерВерсииКонфигурации.Установить(ВерсияМетаданных);
			
			#Если Клиент Тогда
			Состояние("");
			#КонецЕсли
			
		КонецЕсли;
		
	Исключение
		
		#Если Клиент Тогда
		
		ОписаниеОшибки = ОписаниеОшибки();
		
		ТекстОшибки = НСтр("ru='Не удалось обновить правила и программы проверки.
			|Выполните обновление вручную из главного меню: ""Настройка"" - ""Обновить программы и правила"".
			|Описание ошибки: %1'");
		
		ТекстОшибки = СтрШаблон(ТекстОшибки, ОписаниеОшибки);
		
		Предупреждение(ТекстОшибки);
		
		#КонецЕсли
		
		Событие = НСтр("ru='Обновление информационной базы'", Метаданные.ОсновнойЯзык.КодЯзыка);
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		Сообщение = СтрШаблон(НСтр("ru='Не удалось обновить информационную базу до версии %1 по причине:
			|%2'"), ВерсияМетаданных, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,,, Сообщение);
		
		Сообщить(Сообщение);
		
	КонецПопытки;
	
КонецПроцедуры

// Запускает обновление информационной базы в фоновом задании.
//
Процедура ВыполнитьОбновлениеИнформационнойБазы() Экспорт
	
	ЗначениеКонстанты = СокрЛП(Константы.НомерВерсииКонфигурации.Получить());
	МассивЭлементовКонстанты = СтрРазделить(ЗначениеКонстанты, Символы.Таб);
	
	СтарыйНомерВерсии = МассивЭлементовКонстанты[0];
	ПользовательВладелецЗадания = "";
	ИДФоновогоЗадания = "";
	
	// Проверим, что в константе находятся данные регламентного задания,
	// которые представляют из себя 3 значения:
	// НомерРелиза,ИмяПользователя,УникальныйИдентификаторЗадания с Символы.Таб в качестве разделителя.
	Если МассивЭлементовКонстанты.Количество() > 2 Тогда
		
		ПользовательВладелецЗадания = МассивЭлементовКонстанты[1];
		ИДФоновогоЗадания = МассивЭлементовКонстанты[2];
		
		Если ПользовательВладелецЗадания <> ИмяПользователя() Тогда
			Возврат;
		КонецЕсли;
		
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ИДФоновогоЗадания));
		
		#Если Клиент Тогда
		
		ТекстСообщения = "";
		
		ОшибкиЕсть = Ложь;
		Если ФоновоеЗадание = Неопределено Тогда
			
			ОшибкиЕсть = Истина;
			ТекстСообщения = НСтр("ru='В настоящий момент фоновое задание обновления ИБ не обнаружено.
				|Возможно, оно было прервано.'");
			
		ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			
			// Продолжаем обновление, ничего не делаем.
			
		ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
			
			ОшибкиЕсть = Истина;
			Информация = ФоновоеЗадание.ИнформацияОбОшибке;
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru='%1
				|Описание: %2
				|ИмяМодуля: %3
				|НомерСтроки: %4
				|ИсходнаяСтрока: %5'"),
					НСтр("ru='Обновление информационной базы завершилось аварийно.'"),
					Информация.Описание,
					Информация.ИмяМодуля,
					Информация.НомерСтроки,
					Информация.ИсходнаяСтрока);
			
		ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
			
			Константы.НомерВерсииКонфигурации.Установить(СтарыйНомерВерсии);
			Возврат;
			
		КонецЕсли;
		
		Если НЕ ОшибкиЕсть Тогда
			Возврат;
		КонецЕсли;
		
		ТекстОшибки = НСтр("ru='В предыдущем сеансе было запущено фоновое задание для обновления информационной базы: %1'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ИДФоновогоЗадания);
		Сообщить(ТекстОшибки);
		
		Сообщить(ТекстСообщения);
		
		ТекстВопроса = НСтр("ru='Обновление завершилось с ошибками. Перезапустить обновление информационной базы?'");
		Результат = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет, НСтр("ru='Изменен номер релиза'"));
		
		Если Результат <> КодВозвратаДиалога.Да Тогда
			Константы.НомерВерсииКонфигурации.Установить(СтарыйНомерВерсии);
			Возврат;
		КонецЕсли;
		
		#КонецЕсли
		
	КонецЕсли;
	
	Если СтарыйНомерВерсии = Метаданные.Версия Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗадания = Новый Массив;
	КлючЗадания = "ОбновлениеИБ";
	НаименованиеЗадания = НСтр("ru='Обновление ИБ'");
	
	Отбор = Новый Структура("Ключ, Состояние", КлючЗадания, СостояниеФоновогоЗадания.Активно);
	СуществующиеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Если СуществующиеЗадания.Количество() = 0 Тогда
		Сообщить(СтрШаблон(НСтр("ru='Выполняется обновление информационной базы на версию: %1'"), Метаданные.Версия));
		ФоновоеЗадание = ФоновыеЗадания.Выполнить(
			"ОбновлениеИнформационнойБазы.ВыполнитьОбновлениеИнформационнойБазыФоновымЗаданием",
			ПараметрыЗадания, КлючЗадания, НаименованиеЗадания);
			
		#Если Клиент Тогда
		ЗапущеноОбновлениеБазы = Истина;
		#КонецЕсли
		НовоеЗначениеКонстанты = СтрШаблон("%1%4%2%4%3",
			СтарыйНомерВерсии,
			ИмяПользователя(),
			ФоновоеЗадание.УникальныйИдентификатор,
			Символы.Таб);
		
		Константы.НомерВерсииКонфигурации.Установить(НовоеЗначениеКонстанты);
	КонецЕсли;
	
КонецПроцедуры

// На верхнем уровне удаляет все пустые папки, удаляет "Устаревшие стандарты",
// все элементы группы "Актуальные стандарты" поднимает на уровень выше,
// а пустую папку "Актуальные стандарты" удаляет.
Функция ИзменитьГруппыСтандартов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Требования.Ссылка,
	|	Требования.ЭтоГруппа,
	|	Требования.Наименование,
	|	Требования.Родитель
	|ИЗ
	|	Справочник.Требования КАК Требования
	|ГДЕ
	|	Требования.ЭтоГруппа
	|	И Требования.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", Справочники.Требования.ПустаяСсылка());
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	МаксимальныйКод = ПолучитьМаксимальныйКодТребований();
	Требования = Справочники.Требования;
	
	Пока Выборка.Следующий() Цикл
		
		ИмяЭлемента = СтрЗаменить(ВРег(Выборка.Наименование), " ", "");
		ВыборкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЭлементыГруппы = Требования.Выбрать(Выборка.Ссылка);
		
		Если ВыборкаОбъект.Предопределенный Тогда
			Продолжить;
		ИначеЕсли ИмяЭлемента = "УСТАРЕВШИЕСТАНДАРТЫ" Тогда
			ВыборкаОбъект.Удалить();
		ИначеЕсли ИмяЭлемента = "АКТУАЛЬНЫЕСТАНДАРТЫ" Тогда
			ПустаяСсылка = Требования.ПустаяСсылка();
			
			Флаг = Истина;
			Пока ЭлементыГруппы.Следующий() Цикл
				ЭлементОбъект = ЭлементыГруппы.ПолучитьОбъект();
				ЭлементОбъект.Родитель = ПустаяСсылка;
				Попытка
					ЭлементОбъект.Записать();
				Исключение
					МаксимальныйКод = МаксимальныйКод + 1;
					ЭлементОбъект.Код = МаксимальныйКод;
					Попытка
						ЭлементОбъект.Записать();
					Исключение
						Флаг = Ложь;
					КонецПопытки;
				КонецПопытки;
			КонецЦикла;
			
			Если Флаг Тогда
				ВыборкаОбъект.Удалить();
			КонецЕсли;
		Иначе
			Если Не ЭлементыГруппы.Следующий() Тогда
				ВыборкаОбъект.Удалить();
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

// Возвращает максимальный код из всех элементов справочника "Требования".
//
Функция ПолучитьМаксимальныйКодТребований()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МАКСИМУМ(Требования.Код) КАК Код
	|ИЗ
	|	Справочник.Требования КАК Требования";
	Результат = Запрос.Выполнить().Выбрать();
	
	МаксимальныйКод = 0;
	Пока Результат.Следующий() Цикл
		МаксимальныйКод = Результат.Код;
	КонецЦикла;
	
	Возврат МаксимальныйКод;
	
КонецФункции

Процедура ОчиститьРегистрСведенийВерныеСлова()
	
	ЗапросПоСловам = Новый Запрос;
	ЗапросПоСловам.Текст = "
	|ВЫБРАТЬ
	|	ВерныеСлова.Слово
	|ИЗ
	|	РегистрСведений.ВерныеСлова КАК ВерныеСлова";
	
	Результат = ЗапросПоСловам.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	#Если Клиент Тогда
	ТекстСостояния = НСтр("ru='Выполняется очистка регистра сведений ""Верные слова""'");
	Состояние(ТекстСостояния);
	#КонецЕсли
	
	ВерныеСлова = Неопределено;
	Проверка.ИнициализироватьСловарьВерныхСлов(ВерныеСлова, Ложь);
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ВерныеСлова");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
		Блокировка.Заблокировать();
		
		НаборЗаписей = РегистрыСведений.ВерныеСлова.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		
		МассивЗаписейДляУдаления = Новый Массив;
		Для Каждого Запись Из НаборЗаписей Цикл
			Если ЭтоВерноеСлово(Запись.Слово, ВерныеСлова) Тогда
				МассивЗаписейДляУдаления.Добавить(Запись);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Запись Из МассивЗаписейДляУдаления Цикл
			НаборЗаписей.Удалить(Запись);
		КонецЦикла;
		
		НаборЗаписей.Записать();
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	
КонецПроцедуры

Функция ЭтоВерноеСлово(Знач Слово, ВерныеСлова)
	
	Слово = СокрЛП(ВРег(Слово));
	
	Если СтрДлина(Слово) <= 1 Тогда
		Возврат Истина;
	ИначеЕсли НЕ СловоСодержитТолькоКириллицу(Слово) Тогда
		Возврат Истина;
	ИначеЕсли ВерныеСлова[Слово] = Истина Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Удаляет группы требований и правил с наименованием "1С:Совместимо".
//
Процедура УдалитьСтандартыСовместимо()
	
	НаименованиеСовместимо = "1С:Совместимо";
	
	ГруппаТребованийСовместимо = Справочники.Требования.НайтиПоНаименованию(НаименованиеСовместимо, Истина,
		Справочники.Требования.ПустаяСсылка());
		
	Если ЗначениеЗаполнено(ГруппаТребованийСовместимо) Тогда
		Попытка
			ГруппаТребованийСовместимо.ПолучитьОбъект().Удалить();
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Сообщить(НСтр("ru='Не удалось удалить группу требований <1С:Совместимо>.'") + Символы.ПС
				+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецПопытки;
	КонецЕсли;
	
	ГруппаПравилСовместимо = Справочники.Правила.НайтиПоНаименованию(НаименованиеСовместимо, Истина,
		Справочники.Правила.ПустаяСсылка());
	
	Если ЗначениеЗаполнено(ГруппаПравилСовместимо) Тогда
		Попытка
			ГруппаПравилСовместимо.ПолучитьОбъект().Удалить();
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Сообщить(НСтр("ru='Не удалось удалить группу правил <1С:Совместимо>.'") + Символы.ПС
				+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Функция ИзменитьРодителяТребований(СтарыйРодитель, НовыйРодитель)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Требования.Ссылка
	|ИЗ
	|	Справочник.Требования КАК Требования
	|ГДЕ
	|	Требования.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", СтарыйРодитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТребованиеСсылка = ВыборкаДетальныеЗаписи.Ссылка;
		ТребованиеОбъект = ТребованиеСсылка.ПолучитьОбъект();
		ТребованиеОбъект.Родитель = НовыйРодитель;
		ТребованиеОбъект.Записать();
	КонецЦикла;
	
КонецФункции

Функция ПолучитьГруппуТребований(Наименование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Требования.Ссылка
	|ИЗ
	|	Справочник.Требования КАК Требования
	|ГДЕ
	|	Требования.Родитель = &Родитель
	|	И Требования.ЭтоГруппа = &ЭтоГруппа
	|	И Требования.Наименование = &Наименование
	|	И Требования.Предопределенный = &Предопределенный";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Родитель", Справочники.Требования.ПустаяСсылка());
	Запрос.УстановитьПараметр("ЭтоГруппа", Истина);
	Запрос.УстановитьПараметр("Предопределенный", Ложь);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Ссылка;
	
КонецФункции

Процедура УдалитьГруппуТребований(ГруппаТребований)
	
	Если Не ЗначениеЗаполнено(ГруппаТребований) Тогда
		Возврат;
	КонецЕсли;
	
	Если ГруппаТребований.Предопределенный Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ОбъектГруппыТребований = ГруппаТребований.ПолучитьОбъект();
		ОбъектГруппыТребований.Удалить();
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		Сообщение = СтрШаблон(НСтр("ru='Не удалось удалить группу требований <%1> по причине:
			|%2'"), ОбъектГруппыТребований.Наименование, ОписаниеОшибки);
		Сообщить(Сообщение);
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьГруппыТребованийНаПредопределенные()
	
	Требования = Справочники.Требования;
	
	МассивГруппТребований = Новый Массив;
	МассивГруппТребований.Добавить(Требования.СистемаСтандартов);
	МассивГруппТребований.Добавить(Требования.Орфография);
	МассивГруппТребований.Добавить(Требования.Совместимо);
	
	Для Каждого ГруппаТребований Из МассивГруппТребований Цикл
		
		СтараяГруппаТребований = ПолучитьГруппуТребований(ГруппаТребований.Наименование);
		Если Не ЗначениеЗаполнено(СтараяГруппаТребований) Тогда
			Продолжить;
		КонецЕсли;
		
		ИзменитьРодителяТребований(СтараяГруппаТребований, ГруппаТребований);
		
		УдалитьГруппуТребований(СтараяГруппаТребований);
		
	КонецЦикла;
	
КонецПроцедуры

// Содержит таблицу устаревших требований, заполняется вручную.
//
Функция ПолучитьТаблицуУстаревшихТребований()
	
	ТаблицаТребований = Новый ТаблицаЗначений;
	ТаблицаТребований.Колонки.Добавить("Наименование");
	ТаблицаТребований.Колонки.Добавить("СсылкаНаСтандарт");
	
	УстаревшееТребование = ТаблицаТребований.Добавить();
	УстаревшееТребование.Наименование = "Наименование и значение по умолчанию для флажков";
	УстаревшееТребование.СсылкаНаСтандарт = "http://its.1c.ru/db/translate/?db=v8std&path=src/d810/i8100405.htm";
	
	УстаревшееТребование = ТаблицаТребований.Добавить();
	УстаревшееТребование.Наименование = "Контекстное меню";
	УстаревшееТребование.СсылкаНаСтандарт = "http://its.1c.ru/db/v8std#content:2149184275:1";
	
	УстаревшееТребование = ТаблицаТребований.Добавить();
	УстаревшееТребование.Наименование = "Проверка условных вызовов (БСП)";
	УстаревшееТребование.СсылкаНаСтандарт = "";
	
	Возврат ТаблицаТребований;
	
КонецФункции

// Содержит таблицу устаревших правил, заполняется вручную.
//
Функция ПолучитьТаблицуУстаревшихПравил()
	
	ТаблицаПравил = Новый ТаблицаЗначений;
	ТаблицаПравил.Колонки.Добавить("Наименование");
	ТаблицаПравил.Колонки.Добавить("Код");
	
	УстаревшееПравило = ТаблицаПравил.Добавить();
	УстаревшееПравило.Наименование = "Наименование и значение по умолчанию для флажков (реквизиты объектов)";
	УстаревшееПравило.Код = "Функ.0229";
	
	УстаревшееПравило = ТаблицаПравил.Добавить();
	УстаревшееПравило.Наименование = "Наименование и значение по умолчанию для флажков";
	УстаревшееПравило.Код = "Функ.0413";
	
	УстаревшееПравило = ТаблицаПравил.Добавить();
	УстаревшееПравило.Наименование = "Наименование и значение по умолчанию для флажков";
	УстаревшееПравило.Код = "Функ.0088";
	
	УстаревшееПравило = ТаблицаПравил.Добавить();
	УстаревшееПравило.Наименование = "Контекстное меню";
	УстаревшееПравило.Код = "Функ.0461";
	
	УстаревшееПравило = ТаблицаПравил.Добавить();
	УстаревшееПравило.Наименование = "Проверка вхождения объектов в подсистемы";
	УстаревшееПравило.Код = "Функ.0572";
	
	УстаревшееПравило = ТаблицаПравил.Добавить();
	УстаревшееПравило.Наименование = "Проверка условных вызовов (БСП)";
	УстаревшееПравило.Код = "Функ.0747";
	
	УстаревшееПравило = ТаблицаПравил.Добавить();
	УстаревшееПравило.Наименование = "Проверка условных вызовов (БСП)";
	УстаревшееПравило.Код = "Функ.0745";
	
	УстаревшееПравило = ТаблицаПравил.Добавить();
	УстаревшееПравило.Наименование = "Проверка наличия встроенной справки у ведущих объектов (Совместимо)";
	УстаревшееПравило.Код = "000000123";
	
	УстаревшееПравило = ТаблицаПравил.Добавить();
	УстаревшееПравило.Наименование = "2.3.6. Справочная информация у форм";
	УстаревшееПравило.Код = "Функ.0533";
	
	УстаревшееПравило = ТаблицаПравил.Добавить();
	УстаревшееПравило.Наименование =
		"2.3.6. Конфигурация в целом и ее основные объекты, имеющие свойство ""Справочная информация"", должны ";
	УстаревшееПравило.Код = "Функ.0453";
	
	УстаревшееПравило = ТаблицаПравил.Добавить();
	УстаревшееПравило.Наименование =
		"В случае  если в конфигурации для пользователей необходимо настраивать общие права работы";
	УстаревшееПравило.Код = "Функ.0393";
	
	Возврат ТаблицаПравил;
	
КонецФункции

// Содержит таблицу устаревших ошибок, заполняется вручную.
//
Функция ПолучитьТаблицуУстаревшихОшибок()
	
	ТаблицаОшибок = Новый ТаблицаЗначений;
	ТаблицаОшибок.Колонки.Добавить("Наименование");
	ТаблицаОшибок.Колонки.Добавить("Код");
	
	УстаревшаяОшибка = ТаблицаОшибок.Добавить();
	УстаревшаяОшибка.Наименование = "Обнаружен реквизит, содержащий отрицание";
	УстаревшаяОшибка.Код = "АПК_Функц.106";
	
	УстаревшаяОшибка = ТаблицаОшибок.Добавить();
	УстаревшаяОшибка.Наименование = "Объект не включен ни в одну подсистему.";
	УстаревшаяОшибка.Код = "АПК_Функц.212";
	
	УстаревшаяОшибка = ТаблицаОшибок.Добавить();
	УстаревшаяОшибка.Наименование =
		"Объект включен в обе служебные подсистемы ""Управление торговлей"" и ""Управление предприятием"".";
	УстаревшаяОшибка.Код = "АПК_Функц.213";
	
	УстаревшаяОшибка = ТаблицаОшибок.Добавить();
	УстаревшаяОшибка.Наименование = "Проверка условных вызовов (БСП)";
	УстаревшаяОшибка.Код = "АПК_Функц.268";
	
	УстаревшаяОшибка = ТаблицаОшибок.Добавить();
	УстаревшаяОшибка.Наименование = "Отсутствует справочная информация";
	УстаревшаяОшибка.Код = "АПК_Функц.130";
	
	УстаревшаяОшибка = ТаблицаОшибок.Добавить();
	УстаревшаяОшибка.Наименование = "Справочная информация";
	УстаревшаяОшибка.Код = "АПК_Функц.129";
	
	УстаревшаяОшибка = ТаблицаОшибок.Добавить();
	УстаревшаяОшибка.Наименование = "Имя предопределенного элемента содержит кириллицу и латиницу.";
	УстаревшаяОшибка.Код = "АПК_Функц.266";
	
	Возврат ТаблицаОшибок;
	
КонецФункции

// Обработчик обновления. Удаляет устаревшие стандарты (требования, правила, ошибки).
//
Процедура УдалитьУстаревшиеСтандарты()
	
	УдалитьУстаревшиеТребования();
	
	УдалитьУстаревшиеПравила();
	
	УдалитьУстаревшиеОшибки();
	
КонецПроцедуры

Процедура УдалитьУстаревшиеТребования()
	
	ТаблицаТребований = ПолучитьТаблицуУстаревшихТребований();
	
	Для Каждого Строка Из ТаблицаТребований Цикл
		
		ТребованиеСсылка = ПолучитьТребованиеПоНаименованиюИСсылкеНаСтандарт(Строка.Наименование, Строка.СсылкаНаСтандарт);
		Если НЕ ЗначениеЗаполнено(ТребованиеСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ТребованиеОбъект = ТребованиеСсылка.ПолучитьОбъект();
		ТребованиеОбъект.Удалить();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьУстаревшиеПравила()
	
	ТаблицаПравил = ПолучитьТаблицуУстаревшихПравил();
	
	Для Каждого Строка Из ТаблицаПравил Цикл
		
		ПравилоСсылка = ПолучитьПравилоПоНаименованиюИКоду(Строка.Наименование, Строка.Код);
		Если НЕ ЗначениеЗаполнено(ПравилоСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ПравилоОбъект = ПравилоСсылка.ПолучитьОбъект();
		ПравилоОбъект.Удалить();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьУстаревшиеОшибки()
	
	ТаблицаОшибок = ПолучитьТаблицуУстаревшихОшибок();
	
	Для Каждого Строка Из ТаблицаОшибок Цикл
		
		ОшибкаСсылка = ПолучитьОшибкуПоНаименованиюИКоду(Строка.Наименование, Строка.Код);
		Если НЕ ЗначениеЗаполнено(ОшибкаСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ОшибкаОбъект = ОшибкаСсылка.ПолучитьОбъект();
		ОшибкаОбъект.Удалить();
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТребованиеПоНаименованиюИСсылкеНаСтандарт(Наименование, СсылкаНаСтандарт)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Требования.Ссылка
	|ИЗ
	|	Справочник.Требования КАК Требования
	|ГДЕ
	|	Требования.Наименование = &Наименование
	|	И Требования.СсылкаНаСтандарт = &СсылкаНаСтандарт";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("СсылкаНаСтандарт", СсылкаНаСтандарт);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ТребованиеСсылка = ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		ТребованиеСсылка = Справочники.Требования.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ТребованиеСсылка;
	
КонецФункции

Функция ПолучитьПравилоПоНаименованиюИКоду(Наименование, Код)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Правила.Ссылка
	|ИЗ
	|	Справочник.Правила КАК Правила
	|ГДЕ
	|	Правила.Наименование = &Наименование
	|	И Правила.Код = &Код";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Код", Код);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ПравилоСсылка = ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		ПравилоСсылка = Справочники.Правила.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ПравилоСсылка;
	
КонецФункции

Функция ПолучитьОшибкуПоНаименованиюИКоду(Наименование, Код)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Ошибки.Ссылка
	|ИЗ
	|	Справочник.ОбнаруживаемыеОшибки КАК Ошибки
	|ГДЕ
	|	Ошибки.Наименование = &Наименование
	|	И Ошибки.Код = &Код";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Код", Код);
	
	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ОшибкаСсылка = ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		ОшибкаСсылка = Справочники.ОбнаруживаемыеОшибки.ПустаяСсылка();
	КонецЕсли;
	
	Возврат ОшибкаСсылка;
	
КонецФункции

Функция ПолучитьВложенныеТребования(ГруппаТребований)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Требования.Ссылка
	|ИЗ
	|	Справочник.Требования КАК Требования
	|ГДЕ
	|	Требования.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", ГруппаТребований);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура УдалитьТребование(ТребованиеСсылка)
	
	Попытка
		ТребованиеОбъект = ТребованиеСсылка.ПолучитьОбъект();
		ТребованиеОбъект.Удалить();
	Исключение
		Сообщение = НСтр("ru='Не удалось удалить требование ""%Наименование%""'");
		Если ТребованиеСсылка.ЭтоГруппа Тогда
			Сообщение = СтрЗаменить(Сообщение, "требование", НСтр("ru='группу требований'"));
		КонецЕсли;
		Сообщение = СтрЗаменить(Сообщение, "%Наименование%", ТребованиеСсылка.Наименование);
		Сообщить(Сообщение + Символы.ПС + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьДубльПредопределеннойГруппыТребований(ПредопределеннаяГруппаТребований)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Требования.Ссылка
	|ИЗ
	|	Справочник.Требования КАК Требования
	|ГДЕ
	|	Требования.Предопределенный
	|	И Требования.ЭтоГруппа
	|	И Требования.Родитель = &Родитель
	|	И Требования.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Родитель", Справочники.Требования.ПустаяСсылка());
	Запрос.УстановитьПараметр("Наименование", ПредопределеннаяГруппаТребований.Наименование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	КоличествоГрупп = Выборка.Количество();
	Если КоличествоГрупп = 0 Тогда
		
		Возврат;
		
	ИначеЕсли КоличествоГрупп = 1 Тогда
		
		// Если в группе есть записи, то все верно - выходим.
		Выборка.Следующий();
		ГруппаТребований = Выборка.Ссылка;
		ВложенныеТребования = ПолучитьВложенныеТребования(ГруппаТребований);
		Если ВложенныеТребования.Количество() > 0 Тогда
			Возврат;
		КонецЕсли;
		
		// В группе нет записей, ищем непредопределенный дубль этой записи.
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Требования.Ссылка
		|ИЗ
		|	Справочник.Требования КАК Требования
		|ГДЕ
		|	НЕ Требования.Предопределенный
		|	И Требования.ЭтоГруппа
		|	И Требования.Родитель = &Родитель
		|	И Требования.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Родитель", Справочники.Требования.ПустаяСсылка());
		Запрос.УстановитьПараметр("Наименование", ПредопределеннаяГруппаТребований.Наименование);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() = 0 Тогда
			// дубля нет, выходим
			Возврат;
		КонецЕсли;
		
		// Нашли дубль, проверим, что у него заполнены вложенные требования.
		Пока Выборка.Следующий() Цикл
			ВложенныеТребования = ПолучитьВложенныеТребования(Выборка.Ссылка);
			Если ВложенныеТребования.Количество() > 0 Тогда
				// перенесем требования
				ИзменитьРодителяТребований(Выборка.Ссылка, ГруппаТребований);
			КонецЕсли;
			УдалитьТребование(Выборка.Ссылка);
		КонецЦикла;
		
	Иначе
		
		Пока Выборка.Следующий() Цикл
			ТребованиеСсылка = Выборка.Ссылка;
			ВложенныеТребования = ПолучитьВложенныеТребования(ТребованиеСсылка);
			Если ВложенныеТребования.Количество() = 0 Тогда
				УдалитьТребование(ТребованиеСсылка);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьДубльПредопределенногоТребования(ПредопределенноеТребование)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Требования.Ссылка
	|ИЗ
	|	Справочник.Требования КАК Требования
	|ГДЕ
	|	Требования.Предопределенный
	|	И НЕ Требования.ЭтоГруппа
	|	И Требования.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ПредопределенноеТребование.Наименование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	КоличествоТребований = Выборка.Количество();
	
	Если КоличествоТребований = 0 Тогда
		
		Возврат;
		
	ИначеЕсли КоличествоТребований = 1 Тогда
		
		Выборка.Следующий();
		ТребованиеСсылка = Выборка.Ссылка;
		// Если предопределенное требование одно и лежит не в корне справочника, то все верно - выходим.
		Если ТребованиеСсылка.Родитель <> Справочники.Требования.ПустаяСсылка() Тогда
			Возврат;
		КонецЕсли;
		
		// если предопределенное лежит в корне справочника, то найдем его дубль.
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Требования.Ссылка
		|ИЗ
		|	Справочник.Требования КАК Требования
		|ГДЕ
		|	Требования.Наименование = &Наименование
		|	И НЕ Требования.ЭтоГруппа
		|	И НЕ Требования.Предопределенный";
		
		Запрос.УстановитьПараметр("Наименование", ПредопределенноеТребование.Наименование);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() > 0 Тогда
			// если нашли дубль, то удалим его
			Выборка.Следующий();
			УдалитьТребование(Выборка.Ссылка);
		КонецЕсли;
		
		// Т.к. требование лежит в корне справочника, надо перенести его в группу "Организация работы конфигурации".
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Требования.Ссылка
		|ИЗ
		|	Справочник.Требования КАК Требования
		|ГДЕ
		|	НЕ Требования.Предопределенный
		|	И Требования.ЭтоГруппа
		|	И Требования.Наименование = &Наименование";
		
		Запрос.УстановитьПараметр("Наименование", НСтр("ru='Организация работы конфигурации'"));
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 0 Тогда
			// группы нет, выходим
			Возврат;
		КонецЕсли;
		
		// перенесем в группу
		Выборка.Следующий();
		ТребованиеОбъект = ТребованиеСсылка.ПолучитьОбъект();
		ТребованиеОбъект.Родитель = Выборка.Ссылка;
		ТребованиеОбъект.Записать();
		
	Иначе
		
		// если требований несколько, надо удалить те, что лежат в корне справочника
		Пока Выборка.Следующий() Цикл
			ТребованиеСсылка = Выборка.Ссылка;
			Если ТребованиеСсылка.Родитель = Справочники.Требования.ПустаяСсылка() Тогда
				УдалитьТребование(ТребованиеСсылка);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьДублиТребований()
	
	УдалитьДубльПредопределеннойГруппыТребований(Справочники.Требования.СистемаСтандартов);
	УдалитьДубльПредопределеннойГруппыТребований(Справочники.Требования.Орфография);
	УдалитьДубльПредопределеннойГруппыТребований(Справочники.Требования.Совместимо);
	УдалитьДубльПредопределенногоТребования(Справочники.Требования.ПлатформеннаяПроверкаКонфигурации);
	
КонецПроцедуры

Процедура УдалитьДубльПричиныОсобенности(ПредопределеннаяПричина)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПричиныОсобенности.Ссылка
	|ИЗ
	|	Справочник.ПричиныОсобенности КАК ПричиныОсобенности
	|ГДЕ
	|	ПричиныОсобенности.Предопределенный
	|	И ПричиныОсобенности.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ПредопределеннаяПричина.Наименование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		ПричинаСсылка = Выборка.Ссылка;
		Если ПричинаСсылка = ПредопределеннаяПричина Тогда
			ПричинаОбъект = ПричинаСсылка.ПолучитьОбъект();
			ПричинаОбъект.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьДублиПричинОсобенностей()
	
	УдалитьДубльПричиныОсобенности(Справочники.ПричиныОсобенности.НеполныйОрфографическийСловарь);
	
КонецПроцедуры

Процедура УдалитьДубльОбнаруживаемойОшибки(ПредопределеннаяОшибка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ОбнаруживаемыеОшибки.Ссылка
	|ИЗ
	|	Справочник.ОбнаруживаемыеОшибки КАК ОбнаруживаемыеОшибки
	|ГДЕ
	|	ОбнаруживаемыеОшибки.Предопределенный
	|	И ОбнаруживаемыеОшибки.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", ПредопределеннаяОшибка.Код);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		ОшибкаСсылка = Выборка.Ссылка;
		Если НЕ ЗначениеЗаполнено(ОшибкаСсылка.Критичность) Тогда
			ОшибкаОбъект = ОшибкаСсылка.ПолучитьОбъект();
			ОшибкаОбъект.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьДублиОбнаруживаемыхОшибок()
	
	УдалитьДубльОбнаруживаемойОшибки(Справочники.ОбнаруживаемыеОшибки.ОшибкаАудита);
	УдалитьДубльОбнаруживаемойОшибки(Справочники.ОбнаруживаемыеОшибки.ОшибкаИнтерфейса);
	УдалитьДубльОбнаруживаемойОшибки(Справочники.ОбнаруживаемыеОшибки.ОшибкаФункциональности);
	
КонецПроцедуры

Процедура УдалитьДубльПравила(ПредопределенноеПравило)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Правила.Ссылка
	|ИЗ
	|	Справочник.Правила КАК Правила
	|ГДЕ
	|	Правила.Предопределенный
	|	И Правила.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", ПредопределенноеПравило.Код);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		ПравилоСсылка = Выборка.Ссылка;
		Если ПравилоСсылка.ОбнаруживаемыеОшибки.Количество() = 0 Тогда
			ПравилоОбъект = ПравилоСсылка.ПолучитьОбъект();
			ПравилоОбъект.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьДублиПравил()
	
	УдалитьДубльПравила(Справочники.Правила.Аудит);
	УдалитьДубльПравила(Справочники.Правила.Интерфейс);
	УдалитьДубльПравила(Справочники.Правила.ТестированиеФункциональности);
	
КонецПроцедуры

Процедура ДобавитьПредопределеннуюПричинуОсобенности(ПричинаНаименование)
	
	ПричинаСсылка = Справочники.ПричиныОсобенности.НайтиПоНаименованию(ПричинаНаименование, Истина);
	
	Если ЗначениеЗаполнено(ПричинаСсылка) Тогда
		Если ПричинаСсылка.Предопределенный Тогда
			Возврат;
		КонецЕсли;
		ПричинаОбъект = ПричинаСсылка.ПолучитьОбъект();
	Иначе
		ПричинаОбъект = Справочники.ПричиныОсобенности.СоздатьЭлемент();
		ПричинаОбъект.Наименование = ПричинаНаименование;
	КонецЕсли;
	
	УникальныйИдентификатор = Новый УникальныйИдентификатор;
	
	Попытка
		ПричинаОбъект.ИмяПредопределенныхДанных = "#" + УникальныйИдентификатор;
		ПричинаОбъект.Записать();
	Исключение
		Событие = НСтр("ru='Обновление информационной базы'", Метаданные.ОсновнойЯзык.КодЯзыка);
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		Сообщение = СтрШаблон(НСтр("ru='Не удалось добавить предопределенную причину особенности ""%1"" по причине:
			|%2'"), ПричинаНаименование, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,,, Сообщение);
	КонецПопытки;
	
КонецПроцедуры

Процедура ДобавитьПредопределенныеПричиныОсобенностей()
	
	СтрокаПричин = "Неполный орфографический словарь
		|Проектное решение
		|Не проверять в старых исправительных релизах
		|Не проверять орфографию (идентификатор объекта метаданных, имя переменной и т.п.)
		|Обратная совместимость (ошибка есть, но не может быть исправлена)
		|Исправление отложено";
		
	МассивПричин = СтрРазделить(СтрокаПричин, Символы.ПС);
	
	Для Каждого Причина Из МассивПричин Цикл
		ДобавитьПредопределеннуюПричинуОсобенности(Причина);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПометитьНаУдалениеСлужебноеТребование()
	
	Наименование = "!!! Новые и измененные разделы";
	СсылкаНаСтандарт = "http://its.1c.ru/db/translate/?db=v8std&path=src/d810/I8102100.htm";
	ТребованиеСсылка = ПолучитьТребованиеПоНаименованиюИСсылкеНаСтандарт(Наименование, СсылкаНаСтандарт);
	
	Если НЕ ЗначениеЗаполнено(ТребованиеСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		ТребованиеОбъект = ТребованиеСсылка.ПолучитьОбъект();
		ТребованиеОбъект.УстановитьПометкуУдаления(Истина);
	Исключение
		Событие = НСтр("ru='Обновление информационной базы'", Метаданные.ОсновнойЯзык.КодЯзыка);
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		Сообщение = СтрШаблон(НСтр("ru='Не удалось установить пометку удаления служебного требования ""%1"" по причине:
			|%2'"), Наименование, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,,, Сообщение);
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьПользователейОС()
	
	ПользователиИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	Для Каждого ПользовательИБ Из ПользователиИБ Цикл
		Если НЕ ПользовательИБ.АутентификацияОС ИЛИ НЕ ЗначениеЗаполнено(ПользовательИБ.ПользовательОС) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяПользователя = ?(ЗначениеЗаполнено(ПользовательИБ.ПолноеИмя), ПользовательИБ.ПолноеИмя, ПользовательИБ.Имя);
		
		Пользователь = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя, Истина);
		Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
			Пользователь = Справочники.Пользователи.НайтиПоКоду(ИмяПользователя);
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
			Продолжить;
		КонецЕсли;
		
		ОбъектПользователь = Пользователь.ПолучитьОбъект();
		ОбъектПользователь.ПользовательОС = ПользовательИБ.ПользовательОС;
		ОбъектПользователь.Записать();
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьОбъектВРегистреКомментариевОшибок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КомментарииНайденныхОшибок.Номер,
	|	НайденныеОшибки.Объект,
	|	КомментарииНайденныхОшибок.Комментарий
	|ИЗ
	|	РегистрСведений.КомментарииНайденныхОшибок КАК КомментарииНайденныхОшибок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НайденныеОшибки КАК НайденныеОшибки
	|		ПО КомментарииНайденныхОшибок.Номер = НайденныеОшибки.Номер";
	
	ТаблицаНайденныхОшибок = Запрос.Выполнить().Выгрузить();
	
	КомментарииНаборЗаписей = РегистрыСведений.КомментарииНайденныхОшибок.СоздатьНаборЗаписей();
	КомментарииНаборЗаписей.Прочитать();
	КомментарииНаборЗаписей.Загрузить(ТаблицаНайденныхОшибок);
	КомментарииНаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ПометитьНаУдалениеУстаревшиеДокументы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПроверкаВерсии.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПроверкаВерсии КАК ПроверкаВерсии
	|ГДЕ
	|	ПроверкаВерсии.Версия.ПометкаУдаления
	|	И ПроверкаВерсии.Эталон.ПометкаУдаления
	|	И НЕ ПроверкаВерсии.ПометкаУдаления";
	
	МассивСсылок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Для Каждого ТекущаяСсылка Из МассивСсылок Цикл
		ОбъектДокумент = ТекущаяСсылка.ПолучитьОбъект();
		ОбъектДокумент.УстановитьПометкуУдаления(Истина);
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьРасширеннуюПроверкуДляКонфигурации(КонфигурацияСсылка)
	
	Попытка
		КонфигурацияОбъект = КонфигурацияСсылка.ПолучитьОбъект();
		КонфигурацияОбъект.РасширеннаяПроверкаПоДополнительнымТребованиям = Истина;
		КонфигурацияОбъект.Записать();
	Исключение
		Событие = НСтр("ru='Обновление информационной базы'", Метаданные.ОсновнойЯзык.КодЯзыка);
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		Сообщение = СтрШаблон(НСтр("ru='Не удалось установить расширенную проверку для конфигурации %1 по причине:
			|%2'"), КонфигурацияСсылка.Наименование, ОписаниеОшибки);
		
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,,, Сообщение);
		
		Сообщить(Сообщение);
	КонецПопытки;
	
КонецПроцедуры

Процедура УстановитьРасширеннуюПроверкуДляКонфигураций()
	
	// Устанавливаем расширенную проверку для конфигураций,
	// у которых выбран вариант проверки = "Полная проверка".
	ЗапросПоПолнойПроверке = Новый Запрос;
	ЗапросПоПолнойПроверке.Текст = "
	|ВЫБРАТЬ
	|	Конфигурации.Ссылка КАК Конфигурация
	|ИЗ
	|	Справочник.Конфигурации КАК Конфигурации
	|ГДЕ
	|	Конфигурации.ВариантПроверкиВручную = &ПолнаяПроверка
	|	И НЕ Конфигурации.РасширеннаяПроверкаПоДополнительнымТребованиям
	|	И НЕ Конфигурации.ПометкаУдаления";
	
	ЗапросПоПолнойПроверке.УстановитьПараметр("ПолнаяПроверка", Справочники.ВариантыПроверки.ПолнаяПроверка);
	
	ВыборкаПоПолнойПроверке = ЗапросПоПолнойПроверке.Выполнить().Выбрать();
	
	Пока ВыборкаПоПолнойПроверке.Следующий() Цикл
		УстановитьРасширеннуюПроверкуДляКонфигурации(ВыборкаПоПолнойПроверке.Конфигурация);
	КонецЦикла;
	
	// Устанавливаем расширенную проверку для конфигураций,
	// у которых в варианте проверки вручную выбраны все внутренние требования, кроме новых внутренних требований в 1.1.12,
	// т.к. они еще не включены в проверку конфигураций.
	МассивВнутреннихТребований = ПолучитьВнутренниеТребования(Ложь);
	
	ЗапросПоВариантамПроверки = Новый Запрос;
	ЗапросПоВариантамПроверки.Текст = "
	|ВЫБРАТЬ
	|	ТребованияККонфигурации.Конфигурация КАК Конфигурация,
	|	ТребованияККонфигурации.Требование КАК Требование
	|ИЗ
	|	РегистрСведений.ТребованияККонфигурации КАК ТребованияККонфигурации
	|ГДЕ
	|	ТребованияККонфигурации.ВариантПроверки = ТребованияККонфигурации.Конфигурация.ВариантПроверкиВручную
	|	И ТребованияККонфигурации.Конфигурация.ВариантПроверкиВручную <> &ПолнаяПроверка
	|	И НЕ ТребованияККонфигурации.Конфигурация.ПометкаУдаления
	|	И НЕ ТребованияККонфигурации.Конфигурация.РасширеннаяПроверкаПоДополнительнымТребованиям
	|	И НЕ ТребованияККонфигурации.Требование.ПометкаУдаления
	|	И НЕ ТребованияККонфигурации.Требование.ЭтоГруппа";
	
	ЗапросПоВариантамПроверки.УстановитьПараметр("ПолнаяПроверка", Справочники.ВариантыПроверки.ПолнаяПроверка);
	
	ТаблицаТребованийКонфигураций = ЗапросПоВариантамПроверки.Выполнить().Выгрузить();
	
	ТаблицаКонфигураций = ТаблицаТребованийКонфигураций.Скопировать();
	ТаблицаКонфигураций.Свернуть("Конфигурация");
	
	ТаблицаТребованийКонфигураций.Индексы.Добавить("Конфигурация");
	
	СтруктураОтбора = Новый Структура;
	
	Для Каждого СтрокаТаблицы Из ТаблицаКонфигураций Цикл
		
		КонфигурацияСсылка = СтрокаТаблицы.Конфигурация;
		
		СтруктураОтбора.Вставить("Конфигурация", КонфигурацияСсылка);
		ТаблицаТребованийКонфигурации = ТаблицаТребованийКонфигураций.Скопировать(СтруктураОтбора);
		
		НужнаРасширеннаяПроверка = Истина;
		
		Для Каждого ВнутреннееТребование Из МассивВнутреннихТребований Цикл
			Если ТаблицаТребованийКонфигурации.Найти(ВнутреннееТребование, "Требование") = Неопределено Тогда
				НужнаРасширеннаяПроверка = Ложь;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если НужнаРасширеннаяПроверка Тогда
			УстановитьРасширеннуюПроверкуДляКонфигурации(КонфигурацияСсылка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УстановитьНовоеРасписаниеРегламентногоЗаданияУведомлениеОтветственных()
	
	Попытка
		УведомленияОтветственных = Метаданные.РегламентныеЗадания.УведомленияОтветственных;
		РегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(УведомленияОтветственных);
		
		Расписание = РегламентноеЗадание.Расписание;
		Расписание.ПериодПовтораВТечениеДня = 3600;
		
		РегламентноеЗадание.Записать();
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		
		Сообщение = НСтр("ru='Не удалось установить новое расписание регламентного задания ""Уведомления ответственных"" по причине:%1%2'");
		Сообщение = СтрШаблон(Сообщение, Символы.ПС, ОписаниеОшибки);
		
		Сообщить(Сообщение);
	КонецПопытки;
	
КонецПроцедуры

Процедура ПеренестиФлагиСобранныхДанныхВТабличнуюЧасть()
	
	ВыборкаПоВерсиям = Справочники.Версии.Выбрать();
	Пока ВыборкаПоВерсиям.Следующий() Цикл
		
		ВерсияУстановитьФлагСбораДанных(ВыборкаПоВерсиям.Ссылка, "СобраныДанные", ВыборкаПоВерсиям.УдалитьСобраныДанные);
		ВерсияУстановитьФлагСбораДанных(ВыборкаПоВерсиям.Ссылка, "СобраныДанныеОМетаданных", ВыборкаПоВерсиям.УдалитьСобраныДанныеОМетаданных);
		ВерсияУстановитьФлагСбораДанных(ВыборкаПоВерсиям.Ссылка, "СобраныДанныеОФормах", ВыборкаПоВерсиям.УдалитьСобраныДанныеОФормах);
		ВерсияУстановитьФлагСбораДанных(ВыборкаПоВерсиям.Ссылка, "СобраныДанныеОМодулях", ВыборкаПоВерсиям.УдалитьСобраныДанныеОМодулях);
		ВерсияУстановитьФлагСбораДанных(ВыборкаПоВерсиям.Ссылка, "СобраныДанныеОРолях", ВыборкаПоВерсиям.УдалитьСобраныДанныеОРолях);
		ВерсияУстановитьФлагСбораДанных(ВыборкаПоВерсиям.Ссылка, "СобраныДанныеОМакетах", ВыборкаПоВерсиям.УдалитьСобраныДанныеОМакетах);
		ВерсияУстановитьФлагСбораДанных(ВыборкаПоВерсиям.Ссылка, "СобраныДанныеОСправке", ВыборкаПоВерсиям.УдалитьСобраныДанныеОСправке);
		ВерсияУстановитьФлагСбораДанных(ВыборкаПоВерсиям.Ссылка, "СобраныДанныеПоПроверкеКонфигурации", ВыборкаПоВерсиям.УдалитьСобраныДанныеПоПроверкеКонфигурации);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьРасписанийПроверкиКонфигураций()
	
	Выборка = Справочники.Конфигурации.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		Если Выборка.Расписания.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		
		КонфигурацияОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ТаблицаРасписаний = КонфигурацияОбъект.Расписания;
		
		НоваяСтрока = ТаблицаРасписаний.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, КонфигурацияОбъект);
		НоваяСтрока.ВариантПроверкиПоРасписаниюСтрокой = КонфигурацияОбъект.ВариантПроверкиПоРасписанию.Наименование;
		
		Попытка
			КонфигурацияОбъект.Записать();
		Исключение;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура получает записи РС "Комментарии найденных ошибок",
// для которых нет соответствия в РС "Найденные ошибки", и удаляет их.
//
Процедура УдалитьКомментарииОтсутствующихОшибок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КомментарииНайденныхОшибок.Номер,
	|	КомментарииНайденныхОшибок.Объект,
	|	КомментарииНайденныхОшибок.Комментарий
	|ИЗ
	|	РегистрСведений.КомментарииНайденныхОшибок КАК КомментарииНайденныхОшибок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НайденныеОшибки КАК НайденныеОшибки
	|		ПО КомментарииНайденныхОшибок.Номер = НайденныеОшибки.Номер";
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	КомментарииНаборЗаписей = РегистрыСведений.КомментарииНайденныхОшибок.СоздатьНаборЗаписей();
	КомментарииНаборЗаписей.Прочитать();
	КомментарииНаборЗаписей.Загрузить(Результат);
	КомментарииНаборЗаписей.Записать();
	
КонецПроцедуры

Процедура СинхронизироватьОшибкиИОсобенности()
	
	НомерЗаписи = ПолучитьМаксимальныйНомерОшибки() + 1;
	Состояние = Перечисления.СостояниеОшибки.Особенность;
	СоответствиеПравилИОшибок = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Конфигурации.Ссылка КАК Ссылка,
	|	МАКСИМУМ(ПроверкаВерсии.Дата) КАК Дата
	|ИЗ
	|	Справочник.Конфигурации КАК Конфигурации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПроверкаВерсии КАК ПроверкаВерсии
	|		ПО ПроверкаВерсии.Конфигурация = Конфигурации.Ссылка
	|ГДЕ
	|	НЕ Конфигурации.ЭтоГруппа
	|	И НЕ Конфигурации.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Конфигурации.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	МАКСИМУМ(ПроверкаВерсии.Дата) УБЫВ";
	
	ВыборкаКонфигураций = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаКонфигураций.Следующий() Цикл
		
		ТекущаяКонфигурация = ВыборкаКонфигураций.Ссылка;
		
		ПоследняяВерсия = НайтиПоследнююВерсию(ТекущаяКонфигурация, Ложь);
		ТаблицаОсобенностей = ПолучитьТаблицуОсобенностейКонфигурации(ТекущаяКонфигурация);
		
		Если ТаблицаОсобенностей.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаОбъектов = ПолучитьТаблицуОбъектовКонфигурации(ПоследняяВерсия);
		
		СоответствиеНайденныхОшибок = ПолучитьСоответствиеЗаписейИзРСНайденныеОшибки(ПоследняяВерсия);
		
		СоответствиеОбъектов = Новый Соответствие;
		
		Для Каждого Особенность Из ТаблицаОсобенностей Цикл
			
			ПутьОбъекта = Особенность.Объект;
			Ошибка = Особенность.Ошибка;
			
			Ключ = СтрШаблон("%1.%2.%3", ПутьОбъекта, Ошибка.Код, Особенность.Уточнение);
			Ключ = ВРег(Ключ);
			Ключ = УдалитьНезначащиеСимволы(Ключ);
			
			СуществующаяЗапись = СоответствиеНайденныхОшибок[Ключ];
			Если СуществующаяЗапись <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			НайденныйОбъект = СоответствиеОбъектов[ПутьОбъекта];
			Если НайденныйОбъект = Неопределено Тогда
				НайденныйОбъектСтрока = ТаблицаОбъектов.Найти(ВРег(ПутьОбъекта), "ПутьОбъектаВРег");
				Если НайденныйОбъектСтрока = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				НайденныйОбъект = НайденныйОбъектСтрока.Ссылка;
				СоответствиеОбъектов.Вставить(ПутьОбъекта, НайденныйОбъект);
			КонецЕсли;
			
			НайденноеПравило = СоответствиеПравилИОшибок[Ошибка];
			Если НайденноеПравило = Неопределено Тогда
				НайденноеПравило = ПолучитьПравилоПоОшибке(Ошибка);
				СоответствиеПравилИОшибок.Вставить(Ошибка, НайденноеПравило);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(НайденноеПравило) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяЗапись = РегистрыСведений.НайденныеОшибки.СоздатьМенеджерЗаписи();
			НоваяЗапись.Объект						= НайденныйОбъект;
			НоваяЗапись.Номер						= НомерЗаписи;
			НоваяЗапись.Правило						= НайденноеПравило;
			НоваяЗапись.Ошибка						= Ошибка;
			НоваяЗапись.Состояние					= Состояние;
			НоваяЗапись.АвторОсобенности			= Особенность.АвторОсобенности;
			НоваяЗапись.ДатаПомещенияВОсобенности	= Особенность.ДатаПомещенияВОсобенности;
			НоваяЗапись.Уточнение					= Особенность.Уточнение;
			НоваяЗапись.ПричинаОсобенности			= Особенность.ПричинаОсобенности;
			
			НоваяЗапись.Записать();
			
			НомерЗаписи = НомерЗаписи + 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьТаблицуОсобенностейКонфигурации(Конфигурация)
	
	НаборЗаписей = РегистрыСведений.УдалитьОсобенности.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Конфигурация.Установить(Конфигурация);
	НаборЗаписей.Прочитать();
	Возврат НаборЗаписей.Выгрузить();
	
КонецФункции

Функция ПолучитьСоответствиеЗаписейИзРСНайденныеОшибки(Версия)
	
	Особенности = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НайденныеОшибки.Объект.Путь КАК Объект,
	|	НайденныеОшибки.Ошибка.Код КАК Ошибка,
	|	НайденныеОшибки.Уточнение,
	|	НайденныеОшибки.МестоОбнаружения
	|ИЗ
	|	РегистрСведений.НайденныеОшибки КАК НайденныеОшибки
	|ГДЕ
	|	НайденныеОшибки.Объект.Владелец = &Версия";
	
	Запрос.УстановитьПараметр("Версия", Версия);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат.Количество() = 0 Тогда
		Возврат Особенности;
	КонецЕсли;
	
	Для Каждого СтрокаРезультата Из Результат Цикл
		
		Ключ = СтрШаблон("%1.%2.%3", СтрокаРезультата.Объект, СтрокаРезультата.Ошибка, СтрокаРезультата.Уточнение);
		
		Ключ = ВРег(Ключ);
		Ключ = УдалитьНезначащиеСимволы(Ключ);
		
		Особенности.Вставить(Ключ, СтрокаРезультата);
		
	КонецЦикла;
	
	Возврат Особенности;
	
КонецФункции

Функция ПолучитьПравилоПоОшибке(Ошибка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПравилаОбнаруживаемыеОшибки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Правила.ОбнаруживаемыеОшибки КАК ПравилаОбнаруживаемыеОшибки
	|ГДЕ
	|	ПравилаОбнаруживаемыеОшибки.Ошибка = &Ошибка
	|	И НЕ ПравилаОбнаруживаемыеОшибки.Ссылка.ПометкаУдаления";
	Запрос.УстановитьПараметр("Ошибка", Ошибка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Ссылка;
	КонецЦикла;
	
КонецФункции

#КонецОбласти
